pandas 和 NumPy 相比最大的区别在于 pandas 是为表格或异构数据而生的；而 NumPy 在更偏向于同构数值数组数据

比较常见的提前准备，接下来将会讨论`Series`以及`DataFrame`的用法：

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

### Series

Series 是一维类似数组的对象，包含一系列值（与 NumPy 类型类似）和一个关联的数据标签数组 -- 索引。 最简单的系列仅由一组数据组成：

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

创建一个 Series 时候最好有索引去区分每一个数据点:

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

使用 NumPy 函数或类似 NumPy 的操作（例如，使用 Boolean 数组过滤，标量乘法或数学函数）将保留索引值链接：

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [14]:
import numpy as np

In [15]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

理解序列的另一种方法是将其作为固定长度的有序 dict，因为它是索引值到数据值的映射。,可以在 dict 的许多情况下使用：

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

你可以转换 dict 到 Series 里面：

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

这样的转换会默认 dict 的顺序进行排序，你可以手动更改顺序：

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = pd.Series(sdata, index = states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

因为 California 并没有给定的值所以会直接显示 NaN，你可以通过`isnull`或者`notnull`来检测遗失数据：

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

我们可以直接对 Series 进行数学运算：

In [27]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Series 里面的对象和索引都可以通过`name`赋名，并且索引可以直接更改：

In [28]:
obj4.name = 'population'

In [29]:
obj4.index.name = 'state'

In [30]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

DataFrame 同时具有行索引和列索引； 可以将它视为所有共享相同索引的 Series 的 dict。在后台，数据存储为一个或多个二维块，而不是列表，字典或其他一些一维数组的集合。

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [34]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

对于大的 DataFrame 我们可以用`head`来仅仅选择前5行：

In [35]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

我们还可以通过对列进行排序：

In [36]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

如果一个不存在于 dict 里面的列被进行排序，那么它的对应数值会变成 NaN：

In [37]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [38]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

我们可以单独去查看每一列的特征：

In [40]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

`frame2[column]`适用于任何列名，但`frame2.column`仅当列名是有效的 Python 变量名时才起作用

而查看单独一个行的特征则需要用到`loc`:

In [42]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

要对列进行修改可直接赋值：

In [43]:
frame2['debt'] = 16.5

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [45]:
frame2['debt'] = np.arange(6.)

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

需要注意的是对列进行赋值的时候，长度必须要一致；也可以尝试用 Series 来进行赋值，这样会按照 Series 里面的索引来对应赋值：

In [47]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [48]:
frame2['debt'] = val

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

下面来举例介绍如何增加和删减列：

In [50]:
frame2['eastern'] = frame2.state == 'Ohio' # New column cannot be created with frame2.eastern syntax

In [51]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [52]:
del frame2['eastern'] # `del` function removes the column

In [53]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

数据的另一种常见形式是嵌套的 dict：

In [54]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

如果将嵌套的 dict 传递给 DataFrame，则 pandas 会将外部 dict 键解释为列，将内部键解释为行索引:

In [55]:
frame3 = pd.DataFrame(pop)

In [56]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

DataFrame 同样可以被 transpose:

In [57]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [58]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [59]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [60]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

以下是常用的 *DataFrame* 输入数据：

Type | Notes
:- | :-
2D ndarray | 数据矩阵，传递可选的行和列标签
dict of arrays, lists, or tuples | 每个序列成为 DataFrame 中的一列； 所有序列的长度必须相同
NumPy structured/record array | 同上
dict of Series | 每个值变成一列； 如果未传递任何显式索引，则将每个 Series 的索引合并在一起以形成结果的行索引
dict of dicts | 每个 inner dict 变成一列；行索引原理同上
list of dicts or Series | 每个项在 DataFrame 中变成一行；dict 键或 Series 索引的并集成为 DataFrame 的列标签
list of lists or tuples | 与"2D ndarray" 同理
Another DataFrame | 除非传递不同的索引，否则将使用 DataFrame 的索引
NumPy MaskedArray | 与"2D ndarray"相似，但掩码值在 DataFrame 中变为 NA/missing

### Index Objects

pandas Index objects 负责保存轴标签和其他元数据（例如轴名称）；您在构造 Series 或 DataFrame 时使用的任何数组或其他标签序列都将在内部转换为 Index 对象：

In [62]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [63]:
index = obj.index

In [64]:
index

Index(['a', 'b', 'c'], dtype='object')

In [65]:
index[1:]

Index(['b', 'c'], dtype='object')

索引对象是不可变的，因此用户无法对其进行修改，如果你尝试运行代码`index[1] = 'd'`，你将会得到 TypeError，这一特征使得索引对象在数据结构里更安全。

In [66]:
labels = pd.Index(np.arange(3))

In [67]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [68]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [69]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [71]:
obj2.index is labels

True

In [72]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [73]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [74]:
'Ohio' in frame3.columns

True

In [75]:
2003 in frame3.index

False

在 pandas 里面，索引就像一个固定大小的集合，而且不同于 Python 的集合， pandas 的 Index 可以包含重复的标签（labels）：

In [76]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [77]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

下面是一些常见的 Index 公式和属性：

Method | Description
:- | :-
`append` | 增加新的索引
`difference` | 将集合的差值变为一个索引
`intersection` | 返回集合的交集
`union` | 返回集合的联合
`isin` | 返回 Boolean 数组，指示每个值是否包含在传递的集合中
`delete` | 把 index i 的元素删除并建立新的索引
`drop` | 通过删除传递的值来建立新索引
`insert` | 在 index i 中通过插入新元素来建立新的索引
`is_monotonic` | 如果每个元素大于或等于前一个元素，则返回`True`
`is_unique` | 如果索引没有重复值，则返回`True`
`unique` | 计算索引中唯一值的数组